Repository: netrunner-debian-kde-extras/kvirc
Catalog: po/core/kvs/kvs_*.po
Languages: hu

source: Lag meter was not enabled
hu: Lagméro nincs engedélyezve

source: No such event (%Q)
hu: Nincs ilyen esemény (%Q)

source: No such event handler (%Q) for event %Q
hu: %Q esemény kezelo nem létezik %Q eseményhez

source: Window with ID '%s' not found, returning empty string
hu: Ablak '%s' azonosítóval nem található, visszatérés üres karaktersorral

source: The specified window is not a channel
hu: A megadott ablak nem csatorna

source: This window has no associated IRC context
hu: A megadott ablaknak nincs IRC környezete

source: The $sw() function can be used only in aliases
hu: Az $sw() függvény csak Aliasokan használható

source: [RAW]: %Q
hu: [NYERS]: %Q

source: Failed to send an unknown command as /raw
hu: Ismeretlen parancs küldése /raw -ként sikertelen

source: Call to undefined command '%Q'
hu: Ismeretlen parancs hívása: '%Q'

source: Error in inner alias command call '%Q', called from this context
hu: Hiba aliason belüli parancshíváskor, '%Q' ebbol a környezetbol hívva

source: Invalid data type for parameter "%s"
hu: Helytelen adattípus "%s" paraméternek

source: found empty string where type '%s' was expected
hu: üres karaktersor, ahol '%s' elvárt

source: found string value "%Q" where type '%s' was expected
hu: "%Q" karaktersort kaptam, ahol '%s' típus szükséges

source: found type %Q where type '%s' was expected
hu: %Q típust kaptam, ahol '%s' szükséges

source: Missing non-optional parameter "%s"
hu: "%s" nem opcionális paraméter hiányzik

source: found empty string while a non empty one was expected
hu: üres karaktersor, ahol nem üres szükséges

source: found signed integer "%d" where type 'unsigned integer' was expected
hu: elojeles egészt kaptam (%d), ahol elojel nélküli szükséges

source: The argument of the array count '#' operator didn't evaluate to an array: automatic conversion from type '%Q' supplied
hu: A tömbszámláló argomentum operátor (#) nem kiértékelheto tömbként: automatikus konverzió '%Q'-ról végrehajtva

source: DNS Lookup result for query "%Q"
hu: "%Q" DNS lekérdezés eredménye

source: Error: %Q
hu: Hiba: %Q

source: Hostname %d: %Q
hu: Hosztnév %d: %Q

source: IP address %d: %Q
hu: IP cím: %d: %Q

source: Missing alias name
hu: Hiányzó alias név

source: Alias names can contain only letters, digits, underscores and '::' namespace separators
hu: Alias neve csak betuket, számjegyeket, aláhúzást és '::' névtér elválasztókattartalmazhaz

source: Stray ':' character in alias name: did you mean ...<namespace>::<name> ?
hu: Elcsatangolt ':' az alias nevében. Nem így gondoltad: <névtér>::<név> ?

source: Found an empty namespace in alias name
hu: Üres névteret találtam az alias nevében

source: The alias '%Q' does not exist
hu: '%Q' alias nem létezik

source: The specified window has no button containers
hu: A megadott ablaknak nincsenek gomb tárolói

source: Window button '%Q' not found
hu: '%Q' ablak gomb nem található

source: Can't find the icon '%Q'
hu: '%Q' ikon nem található

source: No handler '%Q' for raw numeric event '%d'
hu: Nincs '%Q' kezelo a '%d' számú nyers eseményhez

source: No handler '%Q' for event '%Q'
hu: Nincs '%Q' kezelo %Q eseményre

source: The specified ping time is invalid: assuming zero (no ping)
hu: A megadott ping ido helytelen: feltételezem, hogy nulla (nincs ping)

source: The specified maximum run time is invalid: assuming zero (infinite)
hu: A megadott maximális futásido helytelen: feltételezem, hogy 0 (végtelen)

source: Failed to start the process
hu: Folyamat indítása sikertelen

source: The specified object does not exist
hu: A megadott objektum nem létezik

source: Missing timer name
hu: Hiányzó idozíto név

source: Missing timeout delay
hu: Idotúllépés késleltetése hiányzik

source: The timeout delay didn't evaluate to an integer
hu: Az idotúllépés késleltetése nem értelmezheto egész számként

source: Unable to add the timer: insufficient system resources
hu: Idozíto indítása sikertelen: elégtelen rendszer eroforrások

source: Module function call failed: can't load the module '%Q': %Q
hu: Modul függvény hívása sikertelen: '%Q':%Q modul betöltése nem lehetséges

source: Module function call failed: the module '%Q' doesn't export a function named '%Q'
hu: Modul függvény hívása sikertelen: a %Q modulnak nincs '%Q' nevu függvénye

source: The target variable didn't evaluate to an integer or real value
hu: A megadott változó nem értelmezheto egész vagy valós számként

source: The right side of operator '&=' didn't evaluate to an integer
hu: Az '&=' operátor jobb oldala nem értelmezheto egész számként

source: The left side of operator '&=' didn't evaluate to an integer
hu: Az '&=' operátor bal oldala nem értelmezheto egész számként

source: The right side of operator '/=' didn't evaluate to a number
hu: Az '/=' operátor jobb oldala nem értelmezheto számként

source: The left side of operator '/=' didn't evaluate to a number
hu: Az '/=' operátor bal oldala nem értelmezheto számként

source: Division by zero
hu: Nullával való osztás

source: The right side of operator '%=' didn't evaluate to a number
hu: A '%=' operátor jobb oldala nem értelmezheto számként

source: The left side of operator '%=' didn't evaluate to a number
hu: A '%=' operátor bal oldala nem értelmezheto számként

source: The right side of operator '*=' didn't evaluate to a number
hu: A '*=' operátor jobb oldala nem értelmezheto számként

source: The left side of operator '*=' didn't evaluate to a number
hu: A '*=' operátor bal oldala nem értelmezheto számként

source: The right side of operator '|=' didn't evaluate to an integer
hu: Az '|=' operátor jobb oldala nem értelmezheto egész számként

source: The left side of operator '|=' didn't evaluate to an integer
hu: Az '|=' operátor bal oldala nem értelmezheto egész számként

source: The right side of operator '<<=' didn't evaluate to an integer
hu: Az ''<<='' operátor jobb oldala nem értelmezheto egész számként

source: The left side of operator '<<=' didn't evaluate to an integer
hu: Az '<<=' operátor bal oldala nem értelmezheto egész számként

source: The right side of operator '>>=' didn't evaluate to an integer
hu: Az '>>=' operátor jobb oldala nem értelmezheto egész számként

source: The left side of operator '>>=' didn't evaluate to an integer
hu: Az '>>=' operátor bal oldala nem értelmezheto egész számként

source: The right side of operator '-=' didn't evaluate to a number
hu: A '-=' operátor jobb oldala nem értelmezheto számként

source: The left side of operator '-=' didn't evaluate to a number
hu: A '=' operátor bal oldala nem értelmezheto számként

source: The right side of operator '+=' didn't evaluate to a number
hu: A '+=' operátor jobb oldala nem értelmezheto számként

source: The left side of operator '+=' didn't evaluate to a number
hu: A '+=' operátor bal oldala nem értelmezheto számként

source: The right side of operator '^=' didn't evaluate to an integer
hu: A '^=' operátor jobb oldala nem értelmezheto egész számként

source: The left side of operator '^=' didn't evaluate to an integer
hu: A '^=' operátor bal oldala nem értelmezheto egész számként

source: Unexpected end of script after '$' function call prefix
hu: A szkript váratlanul véget ért a '$' függvény hívó prefix után

source: Unexpected character %q (unicode %x) after '$' function call prefix
hu: Váratlan %q karakter (unicode %x) a '$' függvény hívó prefix után

source: Empty instruction block for command evaluation
hu: Üres utasítás blokk a parancs kiértékelésnél

source: Parameter identifiers are forbidden in object scope (after the '->' operator)
hu: Azonosító paraméterek tiltottak objektum környezetben (a '->' operátor után)

source: Stray '::' sequence or invalid following alias name
hu: Elcsatangolt '::' vagy helytelen alias név áll utána

source: Syntax error: malformed alias function call identifier
hu: Szintaktikai hiba: hibás alias függvény hívás azonosító

source: Stray ':' character: did you mean '...<namespace>::<alias_name>' ?
hu: Kósza ':' karakter. Úgy érted: '...<névtér>::<alias_név>' ?

source: Syntax error: malformed (alias?) function call identifier
hu: Szintaktikai hiba: hibás (alias ?) függvény hívás azonosító

source: Unterminated c-style multiline comment
hu: Befejezetlen c-stílusú többsoros komment

source: Unexpected end of script in multiline comment
hu: Váratlan szkript vég többsoros kommentnél

source: Stray dot ('.') character or invalid following module command name
hu: Kóbor '.' karakter vagy az azt követo modul parancs név helytelen

source: Syntax error: malformed module command identifier
hu: Szintaktikai hiba: hibás modul parancs azonosító

source: Syntax error: malformed alias identifier
hu: Szintaktikai hiba: hibás alias azonosító

source: Syntax error: malformed (alias?) command identifier
hu: Szintaktikai hiba: hibás (alias?) modul parancs azonosító

source: No such IRC context (%u)
hu: %u IRC környezet azonosító nem létezik

source: This window is not associated to an IRC context
hu: Ez az ablak nincs hozzárendelve IRC környezethez

source: Couldn't construct QDateTime object.
hu: QDateTime objektum létrehozása sikertelen

source: It's not allowed to return values in the constructor
hu: Konstruktorban nem lehet megadni visszatérési értéket

source: Module command call failed: can't load the module '%Q': %Q
hu: Modul parancs hiba: '%Q': %Q modul nem betöltheto

source: This window has no associated IRC context and is not a DCC chat
hu: Az ablaknak nincs IRC környezete és nem DCC beszélgetés ablak

source: Class '%Q' is not defined
hu: '%Q' osztály nincs definiálva

source: The specified parent object does not exist
hu: A megadott szüloobjektum nem létezik

source: There is no option named '%Q'
hu: Nincs '%Q' nevu opció

source: This is not a channel
hu: Ez nem csatorna

source: The 'unset' command needs a variable list
hu: Az 'unset' parancsnak változó listát kell megadni

source: Found character %q (unicode %x) where a variable was expected
hu: %q (unicode %x) karaktert találtam, ahol változóra lenne szükség

source: 'unset' command used without a variable list
hu: 'unset' parancs használata változólista nélkül

source: The 'global' command needs a variable list
hu: A 'global' parancsnak változólistára van szüksége

source: Found character %q (unicode %x) where an open parenthesis was expected
hu: %q (unicode %x) karaktert találtam, ahol bezáró kerek zárójelnek kellene állnia

source: Unexpected end of buffer in class definition
hu: Váratlan puffer vég osztálydefiníciónál

source: Found character %q (unicode %x) where a function name was expected
hu: %q (unicode %x) karaktert találtam, ahol függvény névre lenne szükség

source: The while command needs an expression enclosed in parenthesis
hu: A while parancsnak feltételre van szüksége kerek zárójelekben

source: The last while command in the buffer has no conditional instructions: it's senseless
hu: Az utolsó while parancsnak a pufferban nincsenek megadva feltételek, értelmetlen

source: Unexpected end of script while looking for the instruction block of the while command
hu: Szkript váratlanul véget ért a while blokk instrukciós részében

source: Unexpected end of command after the 'do' command block: expected 'while' keyword
hu: Váratlan parancsvég a 'do' parancsblokk után: 'while' kulcsszó hiányzik

source: Found character %q (unicode %x) where a 'while' keyword was expected
hu: %q (unicode %x) karaktert találtam, ahol a 'while' kulcsszó lenne várható

source: The 'while' block of the 'do' command needs an expression enclosed in parenthesis
hu: A 'do' parancsblokk után egy 'while' kulcsszóra van szükség kerek zárójelben megadott feltételekkel

source: Garbage string after the expression in 'do' command: ignored
hu: Felesleges karakterek a 'do' kifejezés után: mellozve

source: The 'if' command needs an expression enclosed in parenthesis
hu: Az 'if' parancsnak feltételre van szüksége kerek zárójelben megadva

source: The last if command in the buffer has no conditional instructions: it's senseless
hu: Az utolsó 'if' parancsnak a pufferban nincsenek megadva feltételek: értelmetlen

source: Unexpected end of script while looking for the instruction block of the if command
hu: Szkript váratlanul véget ért az if blokk instrukciós részében

source: Unexpected end of buffer while looking for the closing ')' in the 'for' command
hu: Váratlan puffervég a záró ')' keresésekor a for parancsnál

source: The 'for' command needs an expression enclosed in parenthesis
hu: A 'for' parancsnak feltételekre van szüksége kerek zárójelekben

source: Found char %q (unicode %x) while looking for the terminating ')' in 'for' command
hu: %q (unicode %x) karaktert találtam, bezáró zárójelre várva ')' a 'for' utasításban

source: Empty infinite 'for' loop: fix the script
hu: Üres, végtelen 'for' ciklus: javítsd a szkriptet

source: The 'foreach' command needs an expression enclosed in parenthesis
hu: A 'foreach' parancsnak feltételekre van szüksége kerek zárójelben

source: The 'foreach' command expects a writeable iteration variable as first parameter
hu: A 'foreach' parancsnak írható ciklusváltozóra van szüksége elso paraméterként

source: Found character '%q' (unicode %x) where '%' or '$' was expected: see /help foreach for the command syntax
hu: '%q' (unicode %x) karaktert találtam ahol '%' vagy '$' kellene: lásd /help foreach az utasítás helyes szintaxisáért

source: Unexpected function call as 'foreach' iteration variable
hu: Váratlan függvényhívás a 'foreach' iterációs változójaként

source: Unexpected read-only variable as 'foreach' iteration variable
hu: Váratlan csak olvasható változó a 'foreach' iterációs változója

source: Unexpected end of 'foreach' parameters: at least one iteration data argument must be given
hu: 'foreach' paraméterlistája váratlanul véget ért: legalább egy iterációs adat argomentumot meg kell adni

source: The 'foreach' command expects a comma separated list of iteration data items after the first parameter
hu: A 'foreach' parancs vesszovel elválasztott adat listát vár amin végig iterálhat az elso paraméter után

source: Found empty 'foreach' execution block: maybe you need to fix your script?
hu: Üres 'foreach' blokkot találtam: talán javítani kellene a scriptedet?

source: The 'switch' command needs an expression enclosed in parenthesis
hu: A 'switch' utasításnak kerek zárójelekben foglalt kifejezést kell megadni

source: Unexpected end of buffer in switch condition block
hu: Váratlan puffervég a 'switch' feltétel blokkjában

source: Found character %q (unicode %x) where a 'case','match','regexp','default' or 'break' label was expected
hu: %q (unicode %x) karatert találtam ahol a 'case','match','regexp','default' vagy 'break' kulcsszavak valamelyikére lenne szükségem

source: Found 'break' label where a 'case','match','regexp' or 'default' label was expected
hu: 'break' kulcsszót találtam ahol a 'case','match','regexp' vagy 'default' kulcsszavak valamelyikére lenne szükségem

source: Found token '%Q' where a 'case','match','regexp','default' or 'break' label was expected
hu: '%Q' karaktersort találtam, ahol 'case','match','regexp','default' vagy 'break' engedélyezett

source: Senseless empty switch command: fix the script
hu: Értelmetlen üres switch utasítás: javítsd a scriptet

source: Unexpected end of buffer in defpopup block
hu: Váratlan puffervég a defpopup blokkban

source: Found character %q (unicode %x) where a 'prologue', 'separator', 'label', 'popup', 'item', 'extpopup' or 'epilogue' label was expected
hu: %q (unicode %x) karaktert találtam, ahol a 'prologue', 'separator', 'label', 'popup', 'item', 'extpopup' vagy 'epilogue' valamelyikére számítottam

source: Found empty prologue block: maybe you need to fix the script?
hu: Üres 'prologue' blokk: talán javítani kellene a szkriptedet?

source: Found empty epilogue block: maybe you need to fix the script?
hu: Üres 'epilogue' blokkot találtam: talán javítani kellene a szkriptedet?

source: Unexpected empty <text> field in label parameters. See /help defpopup for the syntax
hu: Váratlanul üres <szöveg> mezo 'label' paramétereknél. Lásd: /help defpopup a helyes szintaktikáért

source: Unexpected empty <text> field in extpopup parameters. See /help defpopup for the syntax
hu: Váratlanul üres <szöveg> mezo az 'extpopup' paramétereknél. Lásd: /help defpopup a helyes szintaktikáért

source: Found empty instruction for popup item: maybe you need to fix the script?
hu: Üres instrukció blokk a felbukkanó elemnél: talán ki kellene javítanod a szkriptet?

source: Unexpected empty <name> field in extpopup parameters. See /help defpopup for the syntax
hu: Váratlanul üres <név> mezo az 'extpopup' paramétereknél. Lásd: /help defpopup a helyes szintaktikáért

source: Found token '%Q' where a 'prologue', 'separator', 'label', 'popup', 'item', 'extpopup' or 'epilogue' label was expected
hu: '%Q' karaktersort találtam a 'prologue', 'separator', 'label', 'popup', 'item', 'extpopup' vagy 'epilogue' címkék valamelyike helyett

source: The 'defpopup' command needs an expression enclosed in parenthesis
hu: A 'defpopup' parancsnak kerek zárójelben megadott kifejezésre van szüksége

source: Found character '%q' (unicode %x) where a slash '/' was expected
hu: '%q' (unicode %x) karaktert találtam ahol perjel '/'-re vártam

source: Missing right operand for operator '+='
hu: Jobb operandus hiányzik a '+=' operátor mellol

source: Missing right operand for operator '-='
hu: Jobb operandus hiányzik a '-=' operátor mellol

source: Missing right operand for operator '<<='
hu: Jobb operandus hiányzik a '<<=' operátor mellol

source: Missing right operand for operator '<<'
hu: Jobb operandus hiányzik a '<=' operátor mellol

source: Missing right operand for operator '<,'
hu: Jobb operandus hiányzik a '<,' operátor mellol

source: Missing right operand for operator '<+'
hu: Jobb operandus hiányzik a '<+' operátor mellol

source: Missing right operand for operator '>>='
hu: Jobb operandus hiányzik a '>>=' operátor mellol

source: Missing right operand for operator '.='
hu: Jobb operandus hiányzik a '.=' operátor mellol

source: Missing right operand for operator '
hu: Jobb operandus hiányzik a ' operátor mellol

source: Unknown operator
hu: Ismeretlen operátor

source: Unexpected (and senseless) read-only data evaluation
hu: Váratlan (és értelmetlen) csak-olvasható adat kiértékelés

source: Syntax error: confused by earlier errors: bailing out
hu: Szintaktikai hiba: korábbi hibák miatt meg vagyok zavarodva, kapitulálok...

source: Unexpected end of script after a variable reference: expected operator
hu: Szkript vége közvetlenül változó referencia után: operátorra számítottam

source: Unexpected character '%q' (unicode %x) after a void function call: end of instruction expected
hu: Váratlan '%q karakter (unicode %x) függvényhívás után: az utasításlista végére számítottam

source: Unexpected character '%q' (unicode %x)
hu: Váratlan karakter: '%q' (unicode %x)

source: Say parse error: Broken command
hu: Say értelmezési hiba: Hibás utasítás

source: Couldn't find a suitable IRC context for the connection, try using -n or -u
hu: Nem található megfelelo IRC környezet a kapcsolathoz, próbáld az -n vagy -u kapcsolóval

source: Another connection is already in progress in the selected IRC context
hu: Egy másik kapcsolat már létrejött a kiválasztott IRC környezetben

source: No menu bar item with text '%Q'
hu: Nincs '%Q' szövegu menüelem

source: Invalid index specified: ignored
hu: Helytelen megadott index: mellozve

source: The popup '%Q' is not defined
hu: A '%Q' felbukkanó nem lett definiálva

source: No target channel specified and the current window is not a channel
hu: Nincs célcsatorna megadva és az aktuális ablak nem csatorna

source: No catalogue %Q for the current language found
hu: Nincs '%Q' katalógus az aktuális nyelvhez

source: The catalogue %Q was not loaded
hu: A '%Q' katalógus nem lett betöltve

source: No target mask/channel specified and the current window is not a channel
hu: Nincs cél maszk/csatorna megadva és az aktuális ablak nem csatorna

source: Operand of unary operator didn't evaluate to a number
hu: Az egyváltozós operátor változója nem értelmezheto számként

source: Left operand didn't evaluate to a number
hu: Bal operandus nem értékelheto ki számként

source: Right operand didn't evaluate to a number
hu: Jobb operandus nem értékelheto ki számként

source: The current window is not a channel, a query or a console
hu: Az aktuális ablak nem csatorna, privát vagy konzol

source: The following string was injected by the user:
hu: Az alábbi karaktersor a felhasználó által beszúrva:

source: The current window is not a channel
hu: Az aktuális ablak nem csatorna

source: Can't kill the timer '%Q' since it is not running
hu: '%Q' idozíto megszakítása nem lehetséges, mivel nem fut

source: List of active timers
hu: Aktív idozítok listája

source: Persistent
hu: Maradandó

source: SingleShot
hu: Egyszeri

source: Unknown
hu: Ismeretlen

source: None
hu: Nincs

source: Total: %u timers running
hu: Összesen %u idozíto fut

source: Event handler %Q is broken: disabling
hu: %Q esemény kezelo hibás: letiltva

source: Module command call failed: the module '%Q' doesn't export a command named '%Q'
hu: Modul utasítás hívása sikertelen: '%Q' modul nem exportál '%Q' nevu parancsot

source: Call to undefined function '%Q'
hu: Nem definiált függvény: '%Q'

source: /me can be used only in channels, queries and DCC chat windows
hu: /me csak csatornákon, privátokban és DCC cset ablakokban használható

source: Invalid IRC url (%Q)
hu: Helytelen IRC url (%Q)

source: The commandline for this url type seems to be broken (%Q)
hu: A parancssor ehhez az url-hez látszólag hibás (%Q)

source: No commandline specified for this type of url (%Q)
hu: A megadott url-hez (%Q) nincs parancssor meghatározva

source: Option setting error: Unknown option or invalid value for option type
hu: Opció beállítási hiba: Ismeretlen opció vagy helytelen megadott értéktípus

source: Choose a file to parse
hu: Válassz ki egy fájlt értelmezésre

source: Failed to load the file '%Q' for parsing
hu: '%Q' betöltése értelmezésre sikertelen

source: Missing channel list
hu: Hiányzó csatorna lista

source: You don't appear to be on channel %s
hu: Nem úgy tunik, hogy fent lennél a %s csatornán

source: Module command call failed: can't load the module 'snd'
hu: Modul parancs hívása sikertelen: 'snd' modul nem betöltheto

source: Module command call failed: the module 'snd' doesn't export a command named 'play'
hu: Modul parancs hívása sikertelen: az 'snd' modul nem exportál 'play' nevu parancsot

source: Popup %Q is not defined
hu: %Q felbukkanó nincs definiálva

source: A popup menu cannot be popped up twice
hu: A felbukkanó menü nem hívható meg másodjára

source: Invalid syntax for screen coordinates, using cursor position
hu: Hibás szintaxis képernyo koordinátáknak, kurzor pozíció használata

source: Empty target specified
hu: Üres megadott cél

source: Hash key evaluated to empty string: fix the script
hu: Hash kulcs üres karaktersorként lett kiértékelve: javítsd a szkriptet

source: The argument of the {} subscript didn't evaluate to a hash: automatic conversion from type '%Q' supplied
hu: A {} argomentumaiként megadott alszkript nem értelmezheto hash-ként: automatikus konverzió a '%Q' típusról megtörtént

source: The argument of the {} subscript didn't evaluate to a hash automatic conversion from %Q supplied
hu: A {} argomentumaiként megadott alszkript nem értelmezheto hash-ként,automatikus konverzió a '%Q' -ról megtörtént

source: [KVS]%c Warning: %Q
hu: [KVS]%c Figyelmeztetés: %Q

source: [KVS]%c Compilation Error: %Q
hu: [KVS]%c Fordítási Hiba: %Q

source: [KVS]%c Runtime Error: %Q
hu: [KVS]%c Futásideju Hiba: %Q

source: [KVS] in script context "%Q"
hu: [KVS] "%Q" szkript környezetben

source: [KVS] in script context "%Q", %Q
hu: [KVS] az alábbi szkript környezetben: "%Q", %Q
