Repository: netrunner-debian-kde-extras/kvirc
Catalog: po/core/kvs/kvs_*.po
Languages: hu

source: [KVS] Code listing:
hu: [KVS] Kód listázása:

source: [KVS] Window:
hu: [KVS] Ablak:

source: [KVS] Destroyed window with pointer %x
hu: [KVS] %x mutatójú ablak megsemmisítve

source: [KVS] Call stack:
hu: [KVS] Verem hívások:

source: Broken slot '%Q' in target object '%Q::%Q' while emitting signal '%Q' from object '%Q::%Q': disconnecting
hu: Hibás foglalat '%Q' a cél objektumban '%Q::Q' '%Q' szignál küldésekor '%Q::%Q' objektumtól: szétkapcsolás.

source: Slot target object destroyed while emitting signal '%Q' from object '%Q::%Q'
hu: '%Q' szignál kibocsátása alatt a foglalat objektum törlodött. Szignált küldo: '%Q::%Q'

source: Listing Qt properties for object named '%Q' of KVS class %Q
hu: '%Q' objektum Qt tulajdonságainak listázása a %Q KVS osztályból

source: Properties for Qt class %s
hu: %s Qt osztály tulajdonságai

source: Property: %c%Q%c, type %Q
hu: Tulajdonság: %c%Q%c, típus %Q

source: %d properties listed
hu: %d tulajdonság listázva

source: The object named '%Q' of class '%Q' has no Qt properties
hu: A '%Q' nevu objektumnak a '%Q' osztályból nincsenek Qt tulajdonságai

source: No Qt property named '%Q' for object named '%Q' of class '%Q'
hu: Nincs '%Q' nevu Qt tulajdonsága '%Q' objektumnak '%Q' osztályban

source: Can't find property named '%Q' for object named '%Q' of class '%Q': the property is indexed but it doesn't really exist
hu: '%Q' tulajdonság nem található '%Q' objektumhoz '%Q' osztályban: a tulajdonság indexelve van, de valójában nem létezik

source: Can't find property named '%Q' for object named '%Q'of class '%Q': the property is indexed and defined but the returned variant is not valid
hu: '%Q' tulajdonság nem található '%Q' objektumhoz '%Q' osztályban: a tulajdonság indexelve van, de a visszakapott változó érvénytelen

source: The property is of type %s but the supplied argument can't be converted to that type (expecting '%s')
hu: A tulajdonság típusa %s de a megadott argomentumot nem lehet konvertálni arra a típusra (%s szükséges)

source: Can't find the requested image
hu: A kért kép nem található

source: Property '%Q' for object named '%Q' of class '%Q' has an unsupported data type
hu: '%Q' tulajdonság '%Q' objektum '%Q' osztályában nem támogatott adattípusa van

source: Can't find property named '%Q' for object named '%Q' of class '%Q': the property is indexed and defined but the returned variant is not valid
hu: '%Q' tulajdonság nem található '%Q' objektumhoz '%Q' osztályban: a tulajdonság indexelve van, de a visszakapott változó érvénytelen

source: Cannot find object function $%Q for object named '%Q' of class '%Q'
hu: $%Q objektum függvény nem található '%Q' objektum '%Q' osztályában

source: Cannot find object function $%Q::%Q for object named '%Q' of class '%Q'
hu: $%Q::%Q objektum függvény nem található '%Q' objektum '%Q' osztályában

source: The argument of the hash count '#' operator didn't evaluate to a hash: automatic conversion from type '%Q' supplied
hu: A '#' mint hash számláló operátor nem értékelheto ki hashként: '%Q' típusról automatikus konverzió történt.

source: Array index didn't evaluate to an integer
hu: Tömb index nem értelmezheto egész számként

source: Array index evaluated to a negative integer (non negative integer expected)
hu: Tömb index negatív egészként lett értelmezve (ahol pozitív egész elvárt)

source: The argument of the [] subscript didn't evaluate to an array: automatic conversion from %Q supplied
hu: A [] alszkript argomentumaként megadott érték nem értelmezheto tömbként: automatikus konverzió '%Q' -ról megtörtént

source: The argument of the [] subscript didn't evaluate to an array: automatic conversion from type '%Q' supplied
hu: A [] alszkript argomentumaként megadott érték nem értelmezheto tömbként: automatikus konverzió 'Q' típusról megtörtént

source: Broken condition in menu setup: assuming false
hu: Hibás feltétel a menü beállításokban: kiértékelve hamisra

source: Broken icon parameter: ignoring
hu: Hibás ikon paraméter: mellozve

source: Can't find the icon '%Q': ignoring
hu: '%Q' ikon nem található: mellozve

source: Broken text parameter: assuming empty string
hu: Hibás szöveges paraméter: mellozve (üresként értelmezve)

source: Recursive definition detected for popup '%Q': ignoring
hu: Rekurzív definíciót észleltem a '%Q' felbukkanónál: mellozés

source: Can't find the external popup '%Q': ignoring
hu: '%Q' külso felbukkanó nem található: mellozés

source: Broken prologue in popup menu '%Q': ignoring
hu: Hibás prológus a '%Q' felbukkanó menüben: mellozve

source: Broken epilogue in popup menu '%Q': ignoring
hu: Hibás epilógus a '%Q' felbukkanó menüben: mellozve

source: The popup '%s' is actually locked: 'self-modifications' are not allowed
hu: A '%s' felbukkanó zárolva van: 'ön-módosítás' nem engedélyezett

source: Can't unload the module: it has locked itself in memory
hu: Modul nem eltávolítható: zárolta magát a memóriába

source: Missing class name
hu: Hiányzó osztálynév

source: Class names can contain only letters, digits, underscores and '::' namespace separators
hu: Osztály neve csak betuket, számjegyeket, aláhúzást és '::' névtér elválasztókattartalmazhat

source: A class can't be a subclass of itself
hu: Az osztály nem lehet önmaga alosztálya

source: Couln't find base class named '%Q'
hu: '%Q' nevu osztály nem található

source: Can't override the builtin class '%Q'
hu: '%Q' beépített osztály nem definiálható felül

source: line %d, near character %d
hu: %d sor, közel a %d karakterhez

source: beginning of input
hu: bevitel kezdete

source: Found character '%q' (unicode 0x%x) where '%c' was expected: see "/help %s" for the command syntax
hu: %q karaktert találtam (unicode 0x%x) ahol '%c' szükséges: lásd "/help %s" a helyes parancs szintaxisért

source: Found end of input where character '%c' was expected: see "/help %s" for the command syntax
hu: Bevitel véget ért ahol '%c' karkater szükséges: lásd "/help %s" a helyes parancs szintaxisért

source: Empty script
hu: Üres szkript

source: Objects have no extended scope variables
hu: Az objektumnak nincsenek kiterjesztett környezeti változói

source: Found character '%q' (unicode %x) where an instruction was expected
hu: '%q' karaktert találtam (unicode %x) ahol utasítást vártam

source: Unterminated instruction block
hu: Lezáratlan utasítás blokk

source: Unexpected end of script in instruction block (missing closing brace)
hu: A szkript váratlanul véget ért az utasítás blokkon belül (hiányzó záró zárójel)

source: Unexpected end of script in parameter list
hu: Váratlan szkript vég a paraméterlistában

source: Unexpected end of line in parameter list
hu: Váratlan sorvég a paraméterlistában

source: Stray backslash at the end of the script
hu: Kósza visszaperjel a szkript végén

source: Unterminated hash key
hu: Lezáratlan hash kulcs

source: Unterminated string constant
hu: Lezáratlan karaktersor konstans

source: Unknown binary operator '=%q': did you mean '==' ?
hu: Ismeretlen kétváltozós operátor '=%q': úgy érted '==' ?

source: Unknown binary operator '%q'
hu: Ismeretlen kétváltozós operátor: '%q'

source: Unexpected end of script in expression
hu: A szkript váratlanul véget ért a kifejezésben

source: Unexpected character %q (unicode %h) in expression. If it meant to be a string use the quotes.
hu: Váratlan %q karakter (unicode %h) a kifejezésben. Ha karaktersort akartál használni, tedd idézojelek közé

source: Unexpected empty expression operand
hu: Váratlan üres kifejezés operandus

source: This command can be used only in windows bound to an IRC context
hu: Ezt a parancs csak olyan ablakokban használható ami egy IRC környezethez tartozik

source: You're not connected to an IRC server
hu: Nincs kapcsolatod IRC szerverrel

source: Missing parameter
hu: Hiányzó paraméter

source: Invalid duration value: using default
hu: Helytelen idotartam érték: alapértelmezett használata

source: No button with type %Q named %Q
hu: Nincs %Q gomb típus %Q névvel

source: Can't delete a null object reference
hu: Null objektum referencia nem törölheto

source: Can't delete an inexisting object
hu: Nem létezo objektum nem törölheto

source: Inexisting popup "%Q"
hu: '%Q' felbukkanó nem létezik

source: Popup menu self-modification is not allowed (the popup is probably open)
hu: Felbukkanó ön-módosítás nem engedélyezett (a felbukkanó valószínuleg meg van jelenítve)

source: The menu item with id "%Q" does not exist in popup "%Q"
hu: '%Q' azonosítójú menüelem nem létezik a "%Q" felbukkanóban

source: The argument of the -w switch did not evaluate to a valid window id: using default
hu: A -w kapcsoló argomentuma nem értelmezheto érvényes ablak azonosítóként: alapértelmezett érték lesz felhasználva

source: The argument of the i switch did not evaluate to a number: using default
hu: Az i kapcsoló argomentuma nem értelmezheto számként: alapértelmezett használata

source: Invalid color-set specification, using default
hu: Érvénytelen színösszeállítás, alapértelmezett használata

source: Window '%Q' not found, using current one
hu: '%Q' ablak nem található, az aktuálist használom
