Repository: netrunner-debian-kde-extras/kvirc
Catalog: po/modules/addon/addon_*.po
Languages: hu

source: Manage Script-Based Addons
hu: Szkript alapú kiegészítések kezelése

source: Configure Addon...
hu: Kiegészítés beállítása...

source: Show Help
hu: Súgó megjelenítése

source: Delete Selected Addons
hu: Kiválasztott kiegészítő törlése

source: Create an Addon as a Distributable Package
hu: Kiegészítő készítése terjeszthető csomagként

source: Install Addon Package From Disk
hu: Kiegészítő telepítése lemezről

source: Get More Addons...
hu: További kiegészítők...

source: Close
hu: Bezár

source: Do you really want to uninstall the addon "%1" ?
hu: Tényleg el szeretnéd távolítani a "%1" kiegészítőt?

source: Confirm addon uninstallation
hu: Kiegészítő eltávolításának megerősítése

source: Yes
hu: Igen

source: No
hu: Nem

source: Please select the addon installation file
hu: Kérlek add meg a kiegészítő telepítő fájlját

source: Install Addon - KVIrc
hu: Kiegészítő telepítése - KVIrc

source: Create Addon Package - KVIrc
hu: Kiegészítő csomag készítése - KVIrc

source: Welcome
hu: Üdv

source: This procedure allows you to export the selected addon to a single package. It is useful when you want to distribute your addon to the public.
hu: Ez az eljárás lehetővé teszi a kijelölt kiegészítő exportálását egy önálló csomagban. Ez akkor lehet hasznos, ha szeretnéd megosztani másokkal is.

source: You will be asked to provide some information like the package name, the version, a description and so on.
hu: További információkat is meg kell adnod, mint például a csomag neve, verziója, leírása és így tovább.

source: Hit the "Next" button to begin.
hu: Kattints a "Következő" gombra a kezdéshez.

source: The selected directory does not exist.
hu: A kiválasztott könyvtár nem létezik

source: The sources directory (src) does not exist.
hu: A forrás könyvtár (src) nem létezik.

source: The translations directory (locale) does not exist.
hu: A fordítás könyvtár (locale) nem létezik

source: The sounds directory (sound) does not exist.
hu: A hangok könyvtár (sound) nem létezik.

source: The pictures directory (pics) does not exist.
hu: A képek könyvtár (pics) nem létezik.

source: The configurations directory (config) does not exist.
hu: A beállítások könyvtár (config) nem létezik.

source: The help directory (help) does not exist.
hu: A segítség könyvtár (help) nem létezik.

source: The initialization script (init.kvs) does not exist.
hu: Az inicializáló szkript (init.kvs) nem létezik.

source: Cannot open file for writing.
hu: Fájl megnyitása írásra sikertelen.

source: Cannot write to the file descriptor.
hu: Fájl leíró írása sikertelen.

source: Addon Packaging Error
hu: Kiegészítő csomagolási hiba

source: Addon Packaging Warning
hu: Kiegészítő csomagolási figyelmeztetés

source: Packaging failed
hu: Csomagolás sikertelen

source: Export Addon - KVIrc
hu: Kiegészítő Export - KVIrc

source: Package Information
hu: Csomag információ

source: Here you need to provide information about you (the packager) and a short description of the package you're creating.
hu: Itt meg kell adnod némi információt magadról (a csomag készítője) és egy rövid leírást a csomagról amit csinálsz.

source: Package &Author:
hu: Csomag készítője:

source: Your name here
hu: A neved írd ide

source: Package &Name:
hu: Csomag neve:

source: No spaces allowed, like MyAddon
hu: Szóköz nem engedélyezett, pld.: SajatKiegeszito

source: Package &Version:
hu: Csomag verziója:

source: Version in the form x.y[.z], like 1.0 or 2.0.3
hu: Verzió az alábbi formában: x.y[.z], pld.: 1.0 vagy 2.0.3

source: Package &Description:
hu: Csomag leírása:

source: Description must be short
hu: Leírásnak rövidnek kell lennie

source: Minimum &KVIrc Version:
hu: Minimális KVIrc verzió:

source: Package Files
hu: Csomag Fájlok

source: Here you need to select the directory where the addon files are.
hu: Itt kell megadnod a könyvtárat, ahol a kiegészítő fájljai megtalálhatóak.

source: Select the source directory:
hu: Válaszd ki a forrás könyvtárat:

source: Select the icon file:
hu: Válassz ikont:

source: Save Package
hu: Csomag mentése

source: Here you need to provide the path where to save the addon package
hu: Add meg az útvonalat, ahova a kiegészítő csomagot mentenéd

source: Select save path:
hu: Mentés útvonalának megadása:

source: Final Information
hu: Végső információk

source: Here there are the information you provided. If these information are correct, hit the "Finish" button to complete the packaging operations.
hu: Itt vannak az általad megadott információk. Ha ezek helyesek, kattints a "Befejezés" gombra, hogy a csomag elkészüljön.

source: This is what I will check for:
hu: Ezeket fogom leellenőrízni:

source: Package Author
hu: Csomag Készítő

source: Package Name
hu: Csomag Név

source: Package Version
hu: Csomag Verzió

source: Package Description
hu: Csomag Leírás

source: Minimum KVIrc Version
hu: Minimum KVIrc Verzió

source: Icon File
hu: Ikon Fájl

source: Source Directory
hu: Forrás Mappa

source: Save Path
hu: Mentési Útvonal

source: File Summary
hu: Fájl Összegzés

source: Here there are the files I found in the directories you provided. If these and the information showed in the previous page are correct, hit the "Finish" button to complete the packaging operations.
hu: Itt vannak a fájlok a mappából, amelyet te adtál meg. Ha ezek és az előző oldalon megadott információk helyesek, kattints a "Befejezés" gombra a csomagolás véglegesítéséhez.

source: Cancel
hu: Mégsem

source: Finish
hu: Befejezés

source: %cAddon id %Q, version %Q%c
hu: %cKiegészítő azonosító %Q, verzió: %Q%c

source: Name: %Q
hu: Név: %Q

source: Description: %Q
hu: Leírás: %Q

source: Total: %d addons installed
hu: Összesen: %d kiegészítő telepítve

source: Uninstalling existing addon version %Q
hu: %Q verziójú kiegészítő eltávolítása

source: The addon "%1" does not exist
hu: Kiegészítő nem létezik: %1

source: The addon "%1" has no configure callback set
hu: A %1 kiegészítőnek nincsenek beállító függvényei

source: The addon "%1" has no help callback set
hu: "%1" kiegészítőnek nincsen súgója

source: Internal error: call a head-shrinker
hu: Belső hiba: szólj egy agyturkásznak

source: The specified version "%Q" is not a valid version string
hu: A megadott %Q verzió nem érvényes verziószám

source: The specified KVIrc version "%Q" is not a valid version string
hu: A megadott KVIrc verzió "%Q" nem érvényes verziószám

source: This KVIrc executable is too old to run this addon (minimum version required is %Q)
hu: Ez a KVIrc túl régi ennek az addonnak a futtatásához (szükséges minimum verzió: "%Q")

source: Attempting to register addon "%Q" with version %Q
hu: "%Q" kiegészítő regisztrációja %Q verzióval

source: The addon "%Q" already exists with version %Q which is higher than %Q
hu: A "%Q" kiegészítő már telepítve van %Q verzióval ami újabb, mint a %Q

source: Addon registration failed
hu: Kiegészítő regisztrációja sikertelen

source: Addon successfully registered
hu: Kiegészítő sikeresen regisztrálva

source: Error installing addon package: %Q
hu: Hiba a kiegészítő csomag telepítése közben: %Q

source: The selected file does not seem to be a valid KVIrc addon package
hu: A kiválasztott fájl nem úgy néz ki mint egy érvényes KVIrc kiegészítő csomag

source: The selected file does not seem to be a valid KVIrc package: %Q
hu: A kiválasztott fájl nem úgy néz ki mint egy érvényes KVIrc csomag: %Q

source: Author
hu: Készítő

source: Created at
hu: Készítés ideje

source: Created with
hu: Felhasznált szoftverek

source: Warning: The addon might be incompatible with this version of KVIrc
hu: Figyelmeztetés: A kiegészítő lehet, hogy nem kompatibilis a KVIrc ezen verziójával

source: Go Back to Package Data
hu: Vissza a csomag adataira

source: Show Details
hu: Részletek megjelenítése

source: Install Addon Pack - KVIrc
hu: Kiegészítő telepítése - KVIrc

source: You're about to install the following addon package
hu: A következő kiegészítőt fogod teleíteni

source: Do you want to proceed with the installation ?
hu: Folytassam a telepítést?

source: Do Not Install
hu: Ne Telepítsd

source: Yes, Proceed
hu: Igen, Telepítsd

source: Failed to unpack the selected file: %Q
hu: %Q kicsomagolása sikertelen

source: One or more files can't be deleted
hu: Egy vagy több fájl nem törölhető

source: Addon Engine Version
hu: Kiegészítő motor verziója

source: Subdirectory
hu: Alkönyvtár
